name: "cat_breed_detector"
platform: "tensorrt_plan"
max_batch_size: 1

input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [48]
  }
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
        gpus: [0]
    }
]
